early-config.org
 -*- fill-column:80; -*-
* early-init.org: Emacs early configuration
:PROPERTIES:
:header-args: :tangle early-init.el
:END:

** Enable Lexical Binding
In order to enable lexical binding in the config, this must be the
first line of Emacs Lisp:

#+begin_src emacs-lisp
;; -*- lexical-binding: t -*-
#+end_src

** Note

For the ~init.el~ file, we'll load the org mode and then dynamically
tangle the org file. We can't do that here because we can't yet load
(a customized version of) org. So, we'll use ~org-babel-tangle~ to
manually generate the ~early-init.el~ file.

#+begin_src emacs-lisp
;;
;; DO NOT EDIT THIS FILE
;; It is produced by tangling the file early-config.org, and may be
;; overwritten. Edit that file, then execute the `org-babel-tangle'
;; command.
#+end_src

** Tweaks to Garbage Collection

We increase the GC threshold during startup, which reduces startup time by
not performing unnecessary collections.

See
https://emacsredux.com/blog/2025/03/28/speed-up-emacs-startup-by-tweaking-the-gc-settings/
for a good discussion.

Temporarily increase GC threshold during startup. This saves about 1.8
seconds on startup time in early testing. Your milage may vary.

#+begin_src emacs-lisp
(setopt gc-cons-threshold most-positive-fixnum)
#+end_src

Restore to a more normal value after startup. However, 800K is Emacs'
startup default, which is probably much too low on modern machines. We
need to try higher settings to see if they impove performance.

#+begin_src emacs-lisp
(add-hook
 'emacs-startup-hook (lambda () (setopt gc-cons-threshold (* 5 1024 1024))))
;; (setopt garbage-collection-messages t) ;; show GC messages for debugging
#+end_src

** Mac-Specific Setups

We need to fix the library path for gcc compilation. This assumes gcc was
installed with `brew`, if not you'll need to customize, or try commenting this
code out and seeing if it just works as-is.

#+begin_src emacs-lisp
(when (equal system-type 'darwin)
  (setenv "LIBRARY_PATH"
          (string-join
           `("/opt/homebrew/opt/gcc/lib/gcc/current"
             "/opt/homebrew/opt/libgccjit/lib/gcc/current"
             ,(car
               (file-expand-wildcards
                "/opt/homebrew/Cellar/gcc/*/lib/gcc/current/gcc/*/*")))
           ":")))
#+end_src

** Initial Frame Size

We need to set this in early-init to set for intitial frame.

**** TODO determine initial values from screen size.

#+begin_src emacs-lisp
(setopt initial-frame-alist
        '((horizontal-scroll-bars)
          (vertical-scroll-bars)
          (width . 150)
          (height . 40)))
#+end_src

** Default Frame Config

The default-frame-alist list defines default values for creation of
new frames. Values in initial-frame-alist override this for the first
frame only.

#+begin_src emacs-lisp
(push '(menu-bar-lines . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)
#+end_src

** Always Use .el File When Newer

We set this here so it gets applied to load of init.el (we hope). IMHO
the default value of this being ~nil~ is nuts.

#+begin_src emacs-lisp
(setopt load-prefer-newer t)
#+end_src

** TODO

Add a hook to this file to automatically tangle when saved. Not sure if that is
possible.

** Set ~lisp~ Subdirectory as User Lisp Directory

The user lisp directory is a new feature in Emacs 31, which automatically
compiles and autoloads lisp files in the director ~user-lisp~ by default. This
changes that to the ~lisp~ directory we already created.

*NOTE*: If you already have a user-lisp directory, you'll need to modify this.

#+begin_src emacs-lisp
(when (boundp 'user-lisp-directory)
  (setopt user-lisp-directory (concat user-emacs-directory "my_emacs/lisp")))
#+end_src

** Local Variables

Tell emacs to not do compilations or autoloads for the ~early-init.el~ file.
Note that the ~eval:~ value actually only applies to this file, but it's
harmless because we never edit ~early-init.el~.

#+begin_src emacs-lisp
;; Local Variables:
;; no-byte-compile: t
;; no-native-compile: t
;; no-update-autoloads: t
;; eval: (add-hook 'after-save-hook #'org-babel-tangle nil t)
;; End:
#+end_src

** End

Finally add a comment so we know the whole file is present.

#+begin_src emacs-lisp
;;; early-init.el ends here
#+end_src
